{
     "blog_entries": {
          "05102024": {
               "title": "MAY 10TH, 2024 - And We're Off!",
               "body" : "Placebo Entertainment has officially kicked off, but before I talk about what we are working on, I want to talk about how we got here.\n\nOur team is made up of 18 incredible artists, designers, and programmers, all of whom are currently students at Bradley University. There were a multitude of factors that led to a bunch of college kids thinking starting their own company was a good idea. For one, half of us were already paying rent for our campus apartments over the summer and decided to stay in town. So we needed something to do. I also have been interested in indie development since way before starting college. Unfortunately, it is usually pretty hard to get an internship at a smaller studio. Being an overly ambitious aspiring producer, the solution was obvious: make my own internship - make my own studio. But I couldn’t do it on my own. I immediately reached out to Miles Rogers, one of the most capable artists I knew, and pitched him my idea. In his defense he didn’t immediately call me crazy. In fact, he was in almost immediately. And thus what would become Placebo Entertainment began.\n\nRegardless of how many different areas Miles is unfairly proficient at, we knew we couldn’t do it on our own. Our first step would need to be creating our team. Luckily, we knew a great group of passionate people, all of whom were excited to spend their summer vacation refining their skills and growing in their disciplines. Almost everyone was planning on working full time - some at industry related jobs, some not - but everyone was ready to jump in and sign their evenings away to work on one more project. I’ll skip over the boring company set up stuff, (the most exciting part was picking the name so you’ve already got the highlights) taking us back to the start of the project!\n\nAs a creative person there is nothing more fulfilling than seeing a bunch of the most capable and creative people you know in one room and just doing what they do best. Within hours we had our concept - which we will be sharing here soon - people had flowcharts, initial characters drawn up, and my personal favorite: lots of documentation. It is admittedly ambitious to try to complete a game in a summer, but if anyone could do it, it would be this team. I should know, I picked them!\n\nWe will be updating this blog weekly to track our production, and share our successes and failures as we try out this indie game dev thing. Stay tuned and get in contact; we’ve got almost three months to go!",
               "images" : [],
               "preview_body" : "Placebo Entertainment has officially kicked off, but before I talk about what we are working on, I want to talk about how we got here."
          },
          "05172024" : {
               "title": "MAY 17TH, 2024 - We are officially a company!",
               "body" : "Nothing like finding out that your LLC paperwork went through like getting a letter letting you know you need to do your taxes. To be honest I have never been so excited to get tax information. For this project I (Rachel Rudy) will be taking on most of the business aspects of the company. This involves contract writing and managing our budget, two things I’ve really never done before. It’s certainly daunting, but I will admit it has been super fun to try to figure all of this stuff out.\n\n In more important game news we have begun getting our hands in-engine. My partner in production Caden and I have gone through the hard work of setting up cross discipline teams. This is the first time we’ve ever done this so seriously for a project, most of our teams are at least five people smaller than the 18 we have now, and so we usually kept to discipline teams, or paired designers with programmers. That’s another thing that’s unique about this project, we are working with a lot of artists! Game Art is a different track at our school, and it’s still relatively new, so it’s still being integrated into the Game Design track. Aside from projects for our end of the year showcase, this is the first time we’ve managed a team with more than one game artist. It has been super fun to watch their progress up close, and I hope to learn a lot more about the game art pipeline during this project.\n\n We will hopefully have some of our other contributors talking on here soon, but in the meantime let me talk to you about what we’re making! \n\nOur current concept is: You’re aboard a spacecraft minutes from destruction. While trying to help crewmates and prevent smaller disasters, the ship will be destroyed. Luckily you’re stuck in a time loop, so you can save the ship. Unfortunately you’re stuck in a time loop, so you have to save the captain and steer the ship out of a black hole all within a short amount of time. We’re taking influence from “The Hitchhiker’s Guide to the Galaxy”  by Douglas Adams, and “A Long Way to a Small Angry Planet” by Becky Chambers to build interesting alien characters and cultures to populate a first-person trial-and-error exploration puzzle game, all to be completed by August.\n\n I know, it’s a little ambitious, but that’s what a summer project is for, right? Well either way, we’re excited to show you our progress as we get to our first playable date, fastly approaching on the 31st! See you then.\n\n\t\t\t\t\t-Rachel",
               "images" : [],
               "preview_body" : "Nothing like finding out that your LLC paperwork went through like getting a letter letting you know you need to do your taxes. "
          }
     }
}
